---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalPanel
source: html/b88181d3-743b-8cca-8fb3-0cc13e5d70aa.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalPanel

An element that represents a surface in the Structural Analytical Model.

## Syntax (C#)
```csharp
public class AnalyticalPanel : AnalyticalSurfaceBase
```